cask_args appdir: '/Applications'

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'drug/ddev'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'curl'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'tmux'
brew 'trash' # Manage the Trash bin
brew 'zlib' # Needed for Memcached
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'beanstalk'
brew 'elasticsearch@2.4'
brew 'go'
brew 'haproxy'
brew 'imagemagick'
brew 'mongodb'
brew 'mysql'
brew 'rbenv'
brew 'nvm'
brew 'openssl'
brew 'redis'
brew 'yarn'
brew 'ddev'


# Apps
cask 'phantomjs'
cask 'item2' 
cask 'alfred'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'gpg-suite'
cask 'imageoptim'
cask 'imagealpha'
cask 'notion'
cask 'sequel-pro'
cask 'slack'
cask 'visual-studio-code'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-hack-nerd-font'

# Mac App Store
mas '1Password', id: 1333542190
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
