cask_args appdir: '/Applications'

# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'curl'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'tmux'
brew 'trash' # Manage the Trash bin
brew 'zlib' # Needed for Memcached
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'beanstalk'
brew 'elasticsearch@2.4'
brew 'go'
brew 'haproxy'
brew 'imagemagick'
brew 'mongodb'
brew 'mysql'
brew 'mysql'
brew 'node'
brew 'nodenv'
brew 'openssl'
brew 'redis'
brew 'yarn'


# Apps
cask 'phantomjs'
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'hyper'
cask 'imageoptim'
cask 'imagealpha'
cask 'java8'
cask 'notion'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-hack-nerd-font'

# Mac App Store
mas '1Password', id: 1333542190
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
mas 'Unsplash', id: 1284863847
mas 'WhatsApp', id: 1147396723 